12/data/attachments/3ecb8def0d9d8782.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Wendy_protect_Friend_90717_9</nif:username>
            <nif:friendToBeRequested>soap_friends_96174e0f-7c12-4fd6-8959-083d7615408d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>